// Вивести на екран всі числа від 1 до 10 за допомогою циклу while. ⬇️

// let num = 1;
// while(num <= 10) {
//     alert(num)
//     num++ ;
// }

// Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for. Якщо число не парне, пропустити його за допомогою continue. ⬇️

// for(let i = 2; i <= 20; i++) {
//     if(i % 2 !== 0) {
//         continue;
//     }
//     console.log(i)
// }

// Вивести на екран таблицю множення числа 7 за допомогою циклу for. ⬇️

// for (let i = 1; i <= 10; i++) {
//     console.log(`7 * ${i} = ${7 * i}`);
// }

// Створити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while. ⬇️

// let mas1 = [1, 2, 3, 4, 5];
// let i = 0;
// while (i < mas1.length) {
//     console.log(mas1[i]);
//     i++;
// }

// Створити масив із числами від 1 до 10. За допомогою циклу for пройтися по масиву та вивести на екран всі числа, крім числа 7. Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break. ⬇️

// let mas2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// for (let i = 0; i < mas2.length; i++) {
//     if (mas2[i] === 7) {
//         break;
//     }
//     console.log(mas2[i]);
// }

// Створити скрипт, який виводить на екран всі числа, які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break. ⬇️

// let n = 5;
// let nn = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// for (let i = 0; i < nn.length; i++) {
//     if (nn[i] >= n) {
//         break;
//     }
//     console.log(nn[i]);
// }

// За допомогою циклу while вивести на екран всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue. ⬇️

// let num = 1;
// while (num <= 20) {
//     if (num % 3 === 0) {
//         num++;
//         continue;
//     }
//     console.log(num);
//     num++;
// }




